Belfast 2
20161023
Eric Robson and the panel are in Belfast, Northern Ireland. Joining Eric are Matthew Wilson, Bunny Guinness and Bob Flowerdew.

Q – We’ve bought three ‘Appleblossom Rosebud’ Geraniums.  A lot of the leaves have browned and dropped off. Why? And can they be overwintered?

 

Matthew – These are actually Pelargoniums.  They thrive in lots of sun and a Mediterranean climate unfortunately.

 

Neil – We do overwinter them but they do need as much sun as you can give them. You do need to cut them back hard in March to get good new growth.

 

 Q – I have 2sq meters (21.5sq ft) outside my ground floor apartment.  What can I grow in pots up a trellis please?

 

Bob – If you have enough sunlight try a grapevine.  Siegerrebe is a good one to try.

 

Bunny – Camellias would do better than you might think.  Night Scented Phlox (Zaluzianskya) along the bottom of it for the scent.  Couple of tulip bulbs and maybe some tarragon and you’ll have a lovely pot.

 

Matthew – Some rose varieties would work – ‘Shropshire Lad’ and ‘The Pilgrim’ for example.

 

Q – I want to grow things vertically along the border of my allotment plot, are there any climbing edibles you can recommend?

 

Bob – Runner beans. Czar is a good perennial for the climate here.

 

Matthew – Hops

 

Bunny – Indian spinach. Gooseberries and redcurrants too. 

 

Eric – Stepover fruit

 

Neil – Tuberous Nasturtium

 

Q – Why did my blueberry ‘Top Hat’ die?

 

Bob – Don’t use tap water – too much lime for them.  Also, they do suffer from vine weevils so watch out for that. And Scale too.  And make sure you don’t waterlog.

 

Bunny – Commercial growers like coir compost for blueberries – I wonder whether you had enough organic matter in your compost

 

Q – My small garden is heavily shaded by trees – what can I get to bloom in the summer?

 

Bob – Cyclamen will work in heavy shade. Wild varieties. 

 

Neil – ‘Chatham Island’ forget-me-not (Myosotidium hortensia).  Also, Arthropodium cirratum from New Zealand – there’s a form with big flowers called Matapouri Bay. 

 

Bunny – Rose Bengal Beauty. Flowers from March to December.  Hydrangea paniculata ‘Limelight’ is amazing.  Camellias are perfect too. 

 

Eric - Clumps of white foxglove

 

Matthew – Japanese anemone – they will grow well and flower for a long time.  Persicaria amplexicaulis ‘Firetail’ would be an excellent perennial

 

Q – Why do my ‘West Country Hybrid’ Lupins not overwinter?

 

Neil – It’s the winter rainfall here.  And Lupins are really attractive to slugs too.

 

 

Q – Tips for successful tulip growing please.

 

Matthew – Don’t plant too early – you run the risk of tulip fire.  Plant from around now up till Christmas. Most tulips are short lived. However, Tulipa tarda can last for a longer time than most. ‘Queen of Night’ will go on for seven or eight years.  Depth – plant at least three-times the depth of the bulb.

 

Neil – In Ireland the wet sees the tulips off.  So I put them in big planters. 

 

Q – What are your top plants for community gardens?

 

Bunny – Apples in containers.  Patio apples.  1m (3ft) or so high.  So much diversity.  Irish peach ripens in early-July.  Put them in baseless pots.

 

Neil – Edibles are best.  The autumn raspberries are great and undemanding. 

 

Bob – Rocket. It grows quickly and it goes well with a number of different dishes. Chives too.  Japanese wineberry is great – very ornamental and lovely berries. 

 

Matthew – Roof-trained tree. 