West Midlands
20161113
Eric Robson and the panel are in the West Midlands. Answering the questions this week are Bunny Guinness, Bob Flowerdew and Christine Walkden.

Q – I accidentally watered a rose bush with weed killer. It’s bravely fighting back.  Should I cosset it or dig it up?

 

Christine – Dig it out and start again

 

Bunny – Depends what weed killer it was but it sounds like it’s badly damaged – start again

 

Q – Can I use rabbit pellets as fertilizer?

 

Bunny – If you give them a rich diet then they will burn the lawn.  I’d water where they’ve been to dilute the area and then put the droppings on the flowerbeds.

 

Bob – I’d put them on the compost

 

Q – What type of hops should I grow? For both brewing taste and aesthetics.

 

Bob – You need female hops.  Seeds spoil the fermentation.  Specialist hops are essential – not wild or ornamental. 

 

Bunny – Contact the national collection of hops – they’ll be able to advise on your local climate/soil etc.  I grow ‘Golden Hop’ – very easy and quite attractive (but no good for beer making). 

 

Bob – Beware – they do grow tall!

 

Q – I have a ten-year-old brown fig that crops very heavily but I can’t make it into a tree shape.  Any advice?

 

Bunny – It’s probably ‘Brown Turkey’. 

 

Bob – They do grow vigorously.  Cut out the long shoots that are long-jointed (big gap between the leaves) as they don’t fruit and just tend to grow and grow.  Leave the short-jointed bits.  Keep any fertilizers away.

 

Q – We have a small, triangular, south-west-facing garden.  Suggestions for fast-growing screens?

 

Bob – Kerrier – it can get 5-8ft depending on how rich the soil is.

 

Christine – Pleached trees.  An evergreen like a Filaria.

 

Q – When we talk about ‘acid loving’ plants are they actually acid loving or are they lime hating?

 

Bob – Both.  Ericaceous plants are the main group we consider acid loving. 

 

Christine – The big problem is the lock up of phosphorous in the soil

 

Bunny – You can get sulphur pastilles to reduce the pH of your soil.  I’m on pH 8 so would never do things like Rhododendrons or Azaleas – but things like Blueberries are fine. 

 

Q – I’ve been growing small apple trees in containers for a few years and they’re all a bit unhappy.  Are there organic things I can do to improve their condition?

 

Bob – There not too bad.  You need to water regularly with rain water.  I use liquid feeds and the start of the year I’d use a top dressing (a handful of blood fish and bone meal) too.  Capsids could be making the small marks.

 

Christine – I think you’ve got a problem with water pressure – that’s what causing the marks.

 

Bunny – These patio apples are very popular at the moment – they’re grown on an M-27 dwarf stock.  I’d take the bottom off the pots and let them grow down into the soil.

 

Bob – You also need to thin out the fruits a bit so they’re well spaced

 

Q – What makes a good front garden?

 

Christine – Diversity, lots of colour, tidiness. 

 

Bob – Neat and tidy. 

 

Bunny – Be interesting. Grow vegetables if you like!

 

Q – I planted a silver birch tree and it’s now taller than my house. I’ve got to cut it down so what should I replace it with?

 

Bunny – Chop it down but let it grow back as a multi-stem. 

 

Christine – Amalanchier ‘Obelisk’ snowy something or other

 

Bob – Juniperus ‘Skyrocket’