Birmingham
20161009
Eric Robson and the horticultural panel visit the Birmingham Botanical Gardens. Bunny Guinness, Bob Flowerdew and Christine Walkden answer the audience questions.

Q – Is human urine an effective deterrent for moles?

 

Bob – Old socks would work just as well because the moles are scared of the smell of humans, but nobody has found a certain way of getting rid of moles.

 

Bunny – Your lawn could be full of worms, which is attracting them. You could use week-old urine in a watering can. A dog can be a very effective garden guard.

 

Christine – Some people have found filling the holes with sawdust to be effective. 

 

Q – How and when should I prune red currants?

 

Bob –  You can prune the plant very well because it will give you bigger berries. Aim for around 5 main branches and reduce the side shoots on each branch to help with the berries’ growth.

 

Q – Our ‘exploding’ cucumbers have stopped growing at an inch (2.5cm) long in multiple different growing conditions – what are we doing wrong?

 

Christine – It could be because of fluctuating temperatures.

 

Q – I have a privet hedge that I would like to replace with a non-allergic pollen-producing hedge, what hedging plants would the panel recommend?

 

Bob – I would remove the privet and dig a trench and put a hurdle fence next to it. Then I would plant a mixture of ivy (which flower very late), in five to ten years the ivy will have completely taken over the hurdle fence and covered it. If you want it to be higher then you will need some strong, permanent posts which can hold up the ivy’s weight. Some of the conifers are also low in pollen.

 

Bunny – You can buy instant ivy hedges on panels if you need a quick solution, up to two metres high. I would probably grow Beech or Griselinia because ivy can have a lot of pollen in the winter.

 

Q – Is there a good way of increasing the temperature of the compost heap? Will weeds re-establish in the heap?

 

Bob – I would make bigger heaps; the bigger the heap, the less heat is lost. I remove weeds that have established roots or seeds on them such as nettles, bindweed and groundsel (Senecio vulgaris) and put them in buckets of water. There are very few roots/seeds that survive water and it will help the rotting process.

 

Bunny – I would put a little sprinkler system on the heap in the summer because it can get very dry. I remove any weed that shows a sign of flowering from the heap and turn the compost a lot.

 

Christine – I separate anything with the potential for regrowth and reseeding and bury it. I turn them under so the chances of them re-surfacing are very low.

 

Q – Our blueberry plants have been covered in webs just as the fruit starts to ripen and some of the berries have had tiny holes and minute caterpillars in them. What is causing this and can we do anything to prevent it?

 

Bob – Blueberries can suffer from Vine Weevil and Scale insects. One of the most common caterpillars are Tortrix caterpillars, if you tap them on the head they shoot backwards very fast. Remove any dead material from around the plants and remove the top inch of compost and replace it with some fresh ericaceous compost. Then brush the plants off before they flower. Small caterpillars are killed off by soft soap solutions too.

 

Bunny – You could put some fleece or enviromesh over the top of them when they are fruiting. I would put a top dressing on and they love a really high organic, acid compost such as coir.

 

Q – My indoor plants (Cyclamen, trailing Begonia and Amaryllis) are dying rapidly, please can you tell me where I’m going wrong?

 

Christine – The cyclamen rotting could be from overwatering. You need to change the compost in the pot or even re-pot them.

 

Bob – Tap water can leave chalky deposits on the soil so I would use rain water. When you re-pot them you should wash the salts from the root system.

 

Q – Are there any additional vegetables or salad crops I could grow on my allotment given our milder winters?

 

Bob – Some carrot varieties can be sown almost all the year around but they benefit from cloche protection. There are also autumn planting shallots and onions. Mangetout (snow pea) peas are hardier and normal peas are being made more mildew resistant, so some of those will come through the winter.

 

Christine – The ‘Kelvedon Wonder’ pea variety sown under cloches does very well over the winter. Spinach, claytonia and mustard leaves will work as long as they are kept reasonably dry.

 

Bunny – Fennel and Celeriac seem to survive better without so many frosts. Beetroot and parsnips will work if you put a big mulch over them and so will lots of hardy Italian lettuces and kale.

 

Q – Why did my Kniphofia bend over at the top rather than stand up straight?

 

Bunny – I think you might have had hail storm damage or heavy wind damage killing all the cells on one side.

 

Bob – A late frost could have touched one side of the stem and damaged it. Blue tits can sit on the plant to try and get the nectar which could be bending it to one side.

 

Christine – I have never been able to find out what’s going on because they flower very late.