Harthill
20161102
Eric Robson presents the show from Harthill in South Yorkshire. Joining Eric this week are Matthew Wilson, Bunny Guinness and Anne Swithinbank.

Q – I attempted edibles for the first time this year.  What can I grow over winter please?

 

Bunny – Broccoli. Brussel sprouts or kale maybe.  Watercress is quite good. Chervil and coriander too. 

 

Anne – Salad rocket.  American land cress is a great winter salad plant.  Really you need to sow in August though.  You could try broad beans (‘Aquadulce Claudia’) and Pea Meteor.

 

Q – My ‘Victoria’ plum tree isn’t bearing fruit; why?

 

Anne – It is only three years old so it should be ok – maybe it’s just having a growth spurt.  Feed it with high potash and then mulch over in spring.  That should help.

 

Bunny – It could be bullfinches taking the buds.

 

Matthew – My plum tree produced one plum this year. My ‘Beurre Hardy’ pear produced one pear too.  Not a great year for them.

 

Q – What can you recommend to go around our new wildlife pond?

 

Anne – Bog flag iris.  Meadowsweet.  Purple loosestrife. 

 

Bunny – Get coir rolls and pin them round the edge of the pond liner and that will help cover the liner up nice and quickly.  Have marsh marigolds (Caltha palustris). 

 

Matthew – Structural planting is important.  Salix britzensis (a willow).  Cornus (stem-coloured Dogwoods).  Flaviramea is a vivid green variety.  Sanguinea too - often called ‘Midwinter Bonfire’ 

 

Anne – Water Mint – you can make mint sorbet from it!

 

Q – I have Kaffir Lilies that are in full flower – how and when can I move them?

 

Anne – You’re talking about (Schizostylis).  They are really easy to move and you can move at any time.

 

Q – If I leave my Begonias in their hangers and overwinter them in the garage will they produce a good display again next year?

 

Matthew – Because of their fleshy stems they’re not the easiest to get through winter.

 

Anne – The textbook would recommend taking them out of the basket – I’ve never tried leaving them in.

 

Bunny – It’s not a big job do take them out. I would do it now and then get them in fresh compost next year.

 

Q – What’s the best way to store tulip bulbs in order to use them again next year?

 

Anne – You want to leave tulips to fully die back… but if you can’t leave them till then move them to a trench somewhere they can.  Dry them off on racks in a cool, airy place and then you can leave them.

 

Bunny – They will never be as good as the first year I’m afraid

 

Matthew – You could plant them overly deep (5-8x the bulb’s size) in the first place – so they’re below the roots of what you’re going to plant next.

 

Q – When is the best time to scarify a lawn?

 

Matthew - Autumn