East Ruston Old Vicarage Postbag
20161016
Peter Gibbs hosts a postbag edition of the show from East Ruston Old Vicarage. Joining him are Pippa Greenwood, Matthew Wilson, Bob Flowerdew and the Old Vicarage's own Alan Gray.

Q – I bought a Dicksonia antarctica tree fern from Australia – there are lots of seedlings growing from its trunk and seem to be different to the main plant. What’s going on?

 

Bob – You’ve got Herb Robert and a Sycamore too

 

Alan – What you do get out of tree ferns a lot is Acacia ‘Mimosa’

 

Pippa – It might have brought over its own micro-flora with it.

 

Matthew – You wouldn’t get another tree fern sprouting from it so the seedlings are growing from spores.

 

Q – A large branch of my plum tree has a wound and is filled with woodlice and dirt, how do I clean and dress it?

 

Pippa – The woodlice are not responsible for any of the damage. I would remove the branch but try and leave the branch collar. The slight swelling left over after the branch is cut will allow it to heal over. If you dress it, you might encourage more mould.

 

Bob – I use a gas blowtorch to sear the end which kills the spores that could infiltrate the cutting.

 

Q – I have had a ‘Ponytail Palm’ (Beaucarnea recurvata) for 30 years, it is now stands at 6ft (1.8m tall) and is too big for the house, can I keep it outside if I protect it?

 

Alan – Also called ‘Elephant’s Foot’ or Nolina.

 

Matthew – I am certain that it will not survive if you put it outside, no matter what protection it is given.

 

Q – My large blue hydrangea has bloomed well for the last three years but not this year. The branches have drooped and the flowers faded quickly. I have only ever deadheaded and removed bindweed from the plant. Do I need to prune, feed, water or take more care over the bindweed?

 

Alan – This is a Mophead Hydrangea macrophylla 'Madame Emile Mouillère' – it flowers (white) on old wood and new wood. I would prune the hydrangea in the winter when the leaves are off.

 

Matthew – I liquid-feed (liquid seaweed) my hydrangeas if they are in too much sun to stop the colour fading.

 

Q – How do I deadhead an Agapanthus and encourage more blooms?

 

Matthew – I have left the heads on because they still have some decorative value but I will take them off at some point. Flowering will depend on where they are in the garden.

 

Pippa – You can compensate for leaving the heads on by using a decent amount of feeding.

 

Q – Is there any way of keeping Dahlia tubers indoors in a centrally heated apartment during the winter?

 

Bob – If your soil is reasonably dry and you can keep the worst of the winter rains and frost off, then it’s far better to leave them in the ground.

 

Pippa – Heavy soil and a wet winter are the real risks. If you can lift them and put them in a rodent-proof, frost proof container with good air circulation then outside should be ok. Do not keep them in the apartment.

 

Q – What options are there to use a greenhouse now rather than wait until spring?

 

Bob – I would grow lots of seedling crops or salad leaves.

 

Pippa – If you do successional sowings every 2 or 3 weeks it will help to prolong the growing. If you need to you could put a layer or two of fleece over the top, it will still allow some air circulation. Make sure you open the doors of the mini greenhouse during the day.

 

Q – Is it better to buy peat-free compost?

 

Matthew – Peat is a brilliant light-weight additive from a commercial perspective. There are some plants that grow better in peat compost but the main reason is to make the compost lighter.

 

Bob – If you want to grow Sun Dews or any other bog plant you have to have peat.

 

Q – Have you seen this bizarre top growth on sweetcorn before?

 

Pippa – It is smut fungus – close relation of rust fungus.

 

Q – Can I eat runner bean leaves cooked like spinach?

 

Bob – It may be a different species to our runner bean – may of the beans, leaves and foliage are poisonous when raw but if they are cooked the poison is broken down. I wouldn’t try it.
