Woburn Abbey
20161030
Eric Robson and the panel visit Woburn Abbey in Bedfordshire. Answering the horticultural questions this week are James Wong, Pippa Greenwood and Matt Biggs.

Q – I bought the book Gardening and Planting by the Moon 2015: Higher Yields in Vegetables and Flowers (by Nick Kollerstrom). The vegetables, especially onions, were very good as a result. Do the panel plant in this method?

James – There is no scientific evidence to prove it as a method but I am interested in it. I have to garden when I have time and so cannot always plan it according to the moon schedule.
Matt – Sometimes the weather conditions happen to be better for growing some crops. I think the climate has more influence than the moon.
Pippa – I could never plan gardening around the moon because of the restrictive timings.

Q – How best can I prevent black spot and mould developing in rose bushes?

Pippa – I would try using resistant varieties and also give the roses a good clean because the fungus can overwinter on the leaves. When you do your early spring pruning, use a magnifying glass and have a close look at the stems to find purple/black small dots. You could use chemicals but start spraying promptly on any spore patches before the leaves break. Try out different types of black spot cleaners.

Q – How do I prune a large magnolia?

James – This is magnolia grandiflora – I have never really needed to prune it. If you have any damaged wood, dead wood or branches that cross over then you might need to prune it.
Pippa – I don’t think they need routine pruning unless you think it is getting in the way of another plant or part of the garden.

Q – What variety of silver birch tree would you recommend for a small garden?

Pippa – You can buy them as cut-back clumps which create a mini group of stems. That will be a lot smaller than a standard silver birch. I recommend Betula utilis var. jacquemontii ‘snow queen’, which is multi-stemmed.
Matt – Make sure you clean them with a soft brush and soapy water to make sure the algae doesn’t form on the north side. They would look beautiful if they were up-lit.

Q – I have a dappled, south-facing border and all the plants do well but fuchsias do not, what can I do?

Matt – The plant is telling you that it is too hot. They do not like the intense heat, they do like bright light and shade as well. The leaves will look scorched and that will indicate that the sun exposure is too much for them. Keep them moist in pots – check them twice a day during the hot summer times.
Pippa – If it happens again I would check the soil because fuchsias are prone to damage from vine weevil.

Q – I have had great difficulty getting parsnip seeds to germinate, what can I do?

Matt – Buy fresh seeds every year. The packet might recommend to sew in February but that might not be a suitable time. I would wait until the soil is warmer and plant up to the end of April or early May. You can start them in modules under glass and before the large tap root has formed. You could also plant each one inside a cardboard toilet roll holder and they need a temperature of around 40 degrees Fahrenheit (4.5 degrees centigrade) to germinate.
Pippa – They are very hard to germinate. You could try station sowing whereby you place three seeds close together to maximise the chances of at least one germinating in each area. Try and do some successional sowings a few weeks apart.
James –The seeds have a short shelf life. I also recommend planting turnip rooted chervil, which has much of the same flavour as parsnips.

Q – When is the best time to move a Phormium?

James – I think it will be hard unless it was grown in a container culture. To balance out root damage you might want to remove some of the canopy but Phormia don’t adjust well to that. I would try it in April time.

Q – What is the worst gardening mistake you have made?

Matt – I have had a lot of Oxalis debilis var. corymbosa come into my garden – a very tenacious weed. Instead of trying to beat it, I am going to use it as groundcover.
James – I have killed a lot of my house plants with used coffee grounds.