Bath
20161002
Eric Robson and his panel of experts are at the University of Bath. Matt Biggs, Anne Swithinbank and Chris Beardshaw answer the horticultural questions from the audience.

Q – My rose has lost its leaves at the beginning of August for the last two years, what has happened?

 

Matt – The rose has had an initial burst of enthusiasm but over time it has run out of steam because it won’t have had access to enough water – as it is surrounded by paving slabs.

 

Chris – Once it is regularly defoliated, the plant is less likely to accumulate nutrients in order to start the burst for next spring. You could be very severe with the cutback and reduce the canopy in order to balance out the damaged root system.

 

Q – Next year we are growing 40 tall sunflower plants in our small garden, can you suggest something that we could use as under-planting to add some interest to our many visitors?

 

Anne – Alpine strawberries and herbs such as origanum or marjoram because they are very durable.

 

Matt – Climbing beans and squashes grow well with sunflowers.

 

Q – Can the panel offer guidelines on whether or not to interfere with the garden so that you can encourage wildlife? I recently angered a frog by digging up my Alchemilla mollus.

 

Anne – As long as you’ve got large areas of covered ground it doesn’t matter; the animals will have a damp, shaded place to go to.

 

Eric – Leave pathways through the garden for the wildlife.

 

Q – I would like to grow an Albizia julibrissin ‘Rosea’, would it be possible to do that against a north-east facing wall?

 

Anne – It is not a very hardy plant so a north/east facing wall could be too cold – a south east facing wall would be better. You need to find a sheltered nook, preferably a very warm south/west facing area with well drained soil.

 

Q – Which two fruit trees would the panel recommend to add to my three apple trees so that I have an orchard? I currently have ‘Herefordshire Russet’, ‘Red Windsor’, and ‘Katy in a Pot’.

 

Anne – I would go for a plum and a damson because that would be a good combination of fruit to eat raw or to use in cooking.

 

Matt – I would plant the ‘Beauty of Bath’ apple and the Medlar tree.

 

Chris – ‘Keswick Codlin’ because it can be used for both cooking and eating raw. I would also go with ‘Scrumptious’ as it is probably the best of the eater apples. ‘Lord Darby’ is a fantastic cooking apple. They are all brilliant pollinators.

 

Q – Could I coppice a ten-year-old Betula utilis ‘jacquemontii’ to make a smaller multi-stemmed tree?

 

Chris – If you want it to produce a true coppice you need to start it at a very early age. You need to entice this young tree to start producing shoots lower down. You could go 2/3ft (60/90cm) above ground level and I would take a strip of the bark out, up to about a third of the way around the trunk. You could use a pruning knife to make two parallel lines 1cm apart and peel the bark out, you can do that quite early in the spring when the sap is rising, before the buds have broken. Once you have taken it out flip it 180 degrees, re-insert it and bind it with something like raffia. This will limit the movement of hormones up and down the plant and a bud could appear below the cut which will receive nutrients from the roots. Hopefully somewhere below the cut you will see new shoots starting to grow.

 

Q – We have a very large and old mulberry tree in our garden which produces an enormous crop of fruit. This year we planted some of the frozen mulberries in compost – what is the best way of over-wintering these seedlings?

 

Anne – I would leave them in the cold greenhouse, they are less likely to get Vine weevil in their pots. I would place them outside in the summer and then plant them in the winter.

 

Q – Is there a perfect direction for the garden on the compass to grow fruit, veg and flowers?

 

Anne – I think south-west facing is better but if the garden is large then more light pours in anyway. If it is a small, north-facing garden then in the winter it will get a lot of shadow.

 

Chris – Direction is important but soil quality is also crucial. Sloping gardens are also great, every 5 degrees from the horizontal is the equivalent of moving 100 miles further south.

 

Q – I would like any advice the panel could give me as to how to manage my large (200m2or 2150 square feet) bamboo? The poles are 5cm (2 inches) diameter and 6m (20ft) tall.

 

Anne – You could make a feature out of it like a bamboo walkway.

 

Matt – You could cut out sections of it and add lights to make into a piece of living art.

 

Chris – You can take inspiration from Japanese bamboo gardens.